app/controllers/posts_controller.rb

	def create
		#render plain: params[:Post].inspect
		@post = Post.new(post_params)

		if(@post.save)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "saliraj"], ["body", "fdsafasd"], ["created_at", "2019-08-07 05:33:19.724961"], ["updated_at", "2019-08-07 05:33:19.724961"]]

	def update
		@post = Post.find(params[:id])

		if(@post.update(post_params))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Hell Yeah"], ["body", "Okay "], ["updated_at", "2019-08-05 08:55:59.152364"], ["id", 3]]